app/controllers/application_controller.rb

  def products
    unless request.post?
    #  redirect_to :action => 'home'
    #  return
    end

    @email = params[:email]
    @file = params[:image]

    if @email && @file
      file_name = File.basename(@file.original_filename)
      # File data in @image.read (File object)

      customer = Customer.find_by_email(@email) || Customer.create(:email => @email)
      @photo = Photo.create(:customer => customer, :file_name => file_name)
---
INSERT INTO "customers" ("updated_at", "email", "created_at") VALUES('2010-06-26 06:10:52', 'scott@vodpod.com', '2010-06-26 06:10:52')
SELECT * FROM "customers" WHERE ("customers"."email" = 'scott@vodpod.com') LIMIT 1
INSERT INTO "photos" ("updated_at", "comments", "file_name", "product", "customer_id", "created_at", "style") VALUES('2010-06-29 03:27:26', NULL, 'headshot copy.jpg', NULL, 1, '2010-06-29 03:27:26', NULL)

  def purchase
    if request.post? && params[:email]
      customer = Customer.find_by_email(params[:email])
      photo = customer.photos.find_by_id(params[:photo_id])
      if photo
        photo.comments = params[:comments]
        photo.product = params[:product]
        photo.style = params[:style]
        photo.save!
---
SELECT * FROM "customers" WHERE ("customers"."email" = 'scott@vodpod.com') LIMIT 1
SELECT * FROM "photos" WHERE ("photos"."id" = '12') AND ("photos".customer_id = 1) LIMIT 1
UPDATE "photos" SET "comments" = '', "style" = 'star', "updated_at" = '2010-06-29 03:27:54', "product" = 'basic' WHERE "id" = 12